"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
user_age = 16  # змінна для збереження віку студента, int
user_name = "Maxim"  # змінна для збереження імені студента, string
is_student = True  # змінна для позначення чи є особа студентом, Boolean
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
name_2 = "John"  # назва змінної не має починатися з цифри
user_age = 25  # В назві змінної використовуємо підкреслення, а не тире(дефіс)
price = 100  # назва змінної не має починатися з символа
lesson = "Math"  # class - зарезервоване (ключове) слово мови Python, його не можна використовувати в назві змінної
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
max_students_count = 30

"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
course_name = "Автоматизація тестування за допомогою Selenium WebDriver (Python)"
number_of_hours = 48
course_cost = 17600

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
course_expenses = number_of_hours / course_cost
print("Затрати курсу", course_name, "становлять", course_expenses)

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
decimal_number = 42
binary_number = 0b101010
hexadecimal_number = 0x2A
octal_number = 0o52

"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
a = 17
b = 5
sum = a + b
print("Сума чисел 17 і 5 становить", sum)

subtraction_1 = a - b
print("Віднімання 5 від 17 становить", subtraction_1)

subtraction_2 = b - a
print("Віднімання 17 від 5 становить", subtraction_2)

multiplication = a * b
print("Множення чисел 17 і 5 становить", multiplication)

division_1 = a / b
print("Просте ділення 17 на 5 становить", division_1)

division_2 = b / a
print("Просте ділення 5 на 17 становить", division_2)

integer_division_1 = a // b
print("Цілочисельне ділення 17 на 5 становить", integer_division_1)

integer_division_2 = b // a
print("Цілочисельне ділення 5 на 17 становить", integer_division_2)

remainder_from_division_1 = a % b
print("Залишок від ділення 17 на 5 становить", remainder_from_division_1)

remainder_from_division_2 = b % a
print("Залишок від ділення 5 на 17 становить", remainder_from_division_2)

extension_1 = a ** b
print("Піднесення 17 в ступінь 5 становить", extension_1)

extension_2 = b ** a
print("Піднесення 5 в ступінь 17 становить", extension_2)

"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
r = 7.5
π = 3.14159
circle_area = π * (r ** 2)
print("Площа кола з радіусом 7.5 становить", circle_area)

"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
a = 7
b = 50
c = 33
d = 14
division_remainder_1 = b % a
division_remainder_2 = c % a
division_remainder_3 = d % a
print("Залишок від ділення 50 на 7 становить", division_remainder_1) 
print("Залишок від ділення 33 на 7 становить", division_remainder_2) 
print("Залишок від ділення 14 на 7 становить", division_remainder_3)

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
Black_sea_area = 436402
Azov_sea_area = 37800
sum = Black_sea_area + Azov_sea_area
print("Чорне та Азовське море разом займають", sum, "км2")

"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
my_name = "Наталія"
print("Перший символ мого імені - ", my_name[0])
print("Останній символ мого імені - ", my_name[6])
print("Довжина мого імені - ", len(my_name), "символів")

"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
str = "Would you tell me, please, which way I ought to go from here?"
print("Перші 6 символів рядка:", str[0:6])
print("Останні 11 символів рядка:", str[- 11:])

"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
poem = '''Любіть Україну у сні й наяву,  
вишневу свою Україну, 
красу її, вічно живу і нову, 
і мову її солов\'їну.'''
print(poem)

"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
str_1 = "Hello"
str_2 = "World"
with_space = str_1 + " " + str_2
with_comma = f'{str_1}, {str_2}'
with_new_line = str_1 + "\n" + str_2
print("Поєднання рядків з пробілом:", with_space)
print("Поєднання рядків з комою:", with_comma)
print("Поєднання рядків з новим рядком:", with_new_line)

"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
line_with_symbols = "Рядок з символами, які потребують екранування: це \"лапки\" і \\ зворотна коса риска"
print(line_with_symbols)

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
name_question = "Як тебе звати? "
name = input(name_question)
age_question = "Скільки тобі років? "
age = input(age_question)
print("Привіт,", name, "! Тобі", age, "років.")
"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
all_fotos = 232
page = 8
count_pages = int(all_fotos / page)
print("Щоб вклеїти 232 фото Ігорю знадобиться", count_pages, "сторінок альбому.") 

"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
color_question = "Який у тебе улюблений колір? "
color = input(color_question)
number_question = "Яке у тебе улюблене число? "
number = input(number_question)
print(f'Вітаю, ви виграли {number} {color} поні в цьому розіграші!')

"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
sum_all_storages = 375291
sum_storage_1_and_storage_2 = 250449
sum_storage_2_and_storage_3 = 222950
storage_3 = sum_all_storages - sum_storage_1_and_storage_2
storage_1 = sum_all_storages - sum_storage_2_and_storage_3
storage_2 = sum_all_storages - storage_1 - storage_3
print("На першому складі розміщені", storage_1, "товарів")
print("На другому складі розміщені", storage_2, "товарів")
print("На третьому складі розміщені", storage_3, "товарів")

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
number_of_months = 18
month_price = 1179
sum = number_of_months * month_price
print("Вартість комп'ютера становить", sum, "гривень")