"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
# код вводити тут
print("\nЗавдання 1")
name_student = "Сергій"  # Ім'я студента
age = 20  # Вік
pupil = True  # Вихованець - студент
print(f"Ім'я студента - {name_student}")
print(f"Вік студента - {age}")
print(f"Він дійсно студент? - {pupil}")

"""
**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
print("\nЗавдання 2")
name = "John" # 2name = "John" - Не можна починати змінні з чисел
user_age = 25  # user-age = 25 - Не можна ставити тире
price = 100  # $price = 100 - Не можна використовувати символи
clas = "Math"  # class = "Math" - Не можна використовувати слова які є виключенням для створення змінних
print("2name = \"John\" - Не можна назви змінних починати з чисел")
print("user-age = 25 - Не можна в змінних ставити тире")
print("$price = 100 - Не можна в змінних використовувати символи")
print("class = \"Math\" - Не можна використовувати слова які є виключенням для створення змінних")

"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
# код вводити тут
print("\nЗавдання 3")
group_student_max = 30
print(f"Максимальна кількості студентів у групі {group_student_max}")
"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
# код вводити тут
print("\nЗавдання 4")
course_name = "EURO"  # назва курсу
number_of_hours = 24  # кількість годин
course_cost = 45.3 # вартість курсу
print(f"Назва курсу - {course_name}")
print(f"Кількість годин - {number_of_hours}")
print(f"Вартість курсу - {course_cost}")
"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
# код вводити тут
print("\nЗавдання 5")
number_of_hours_1 = 24  # кількість годин
course_cost_1 = 48.3 # вартість курсу
print(f"Затрати курсу дорівнюють {number_of_hours / course_cost}")
"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
# код вводити тут
print("\nЗавдання 6")
dec = 42
bin = 0b101010
hex = 0x2a
oct = 0o52
print(f"Десяткове число: {dec}")
print(f"Двійкове число: {bin}")
print(f"Шістнадцяткове число: {hex}")
print(f"Восьмеричне число: {oct}")

"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
# код вводити тут
print("\nЗавдання 7")
print(f"Додавання '17 + 5' дорівнює: {17 + 5}")
print(f"Віднімання '17 - 5' дорівнює:{17 - 5}")
print(f"Множення '17 * 5' дорівнює: {17 * 5}")
print(f"Ділення '17 / 5' дорівнює: {17 / 5}")
print(f"Цілочисельне ділення '17 // 5' дорівнює: {17 // 5}")
print(f"Ділення з остачею '17 % 5' дорівнює: {17 % 5}")
print(f"Піднесення до степеня '17 ** 5' дорівнює: {17 ** 5}")

"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
# код вводити тут
print("\nЗавдання 8")
radius = 7.5
pi = 3.14159
# area = pi*radius**2
print(f"Площа кола з радіусом {radius} дорівнює {pi*radius**2}")
"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
# код вводити тут
print("\nЗавдання 9")
print(f"Залишок від ділення 50/7 дорівнює {50 % 7}")
print(f"Залишок від ділення 33/7 дорівнює {33 % 7}")
print(f"Залишок від ділення 14/7 дорівнює {14 % 7}")

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут
print("\nЗавдання 10")
area_black_sea = 436402
area_azov_sea = 37800
sum_area_sea = area_black_sea + area_azov_sea
print(f"""Площа Чорного моря становить {area_black_sea} км2,\
а площа Азовського моря становить {area_azov_sea} км2.\
\nЯку площу займають Чорне та Азовське моря разом?\
\nВідповідь: \nРазом Чорне та \
Азовське моря займають площу {sum_area_sea} км2.""")
"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
# код вводити тут
print("\nЗавдання 11")
my_name = "Rodion"
print("Перший символ:", my_name[0])
print("Останній символ:", my_name[-1])
print("Довжина рядка:", len(my_name))
"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
# код вводити тут
print("\nЗавдання 12")
line = "Would you tell me, please, which way I ought to go from here?"
print(line)
print(f"Перші 6 символів: {line[:6]}")
print(f"Останні 11 символів: {line[-11:]}")
"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
# код вводити тут
print("\nЗавдання 13")
print('''Якщо хочеш зробити щось добре\
 — зроби це сам''')
"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
# код вводити тут
print("\nЗавдання 14")
print("Hello", "World")
print("Hello", "World", sep=' ')
print("Hello", "World", sep=',')
print("Hello", "World", sep='\n')

"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут
print("\nЗавдання 15")
backslash_and_quotes = 'Треба використати зв\'язок між зворотньою косою рискою\\ і \'лапками\''
print(backslash_and_quotes)

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
# код вводити тут
print("\nЗавдання 16")
name2 = input("Як тебе звати: ")
age = input("Скільки тобі років: ")

print(f"\nПривіт, {name2}! Тобі {age} років.")

"""
**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# код вводити тут
print("\nЗавдання 17")
all_foto = 232  # Кількість всіх фото
one_landscape_page = 8 # Вміщується на одній сторінці
total_page = all_foto//one_landscape_page
foto = "фото"

print(f"Ігор займається фотографією. Він вирішив зібрати всі свої {all_foto} фотографії\
\nта вклеїти в альбом. На одній сторінці може бути розміщено щонайбільше {one_landscape_page} {foto}.\
\nСкільки сторінок знадобиться Ігорю, щоб вклеїти всі {foto}?\
\nВідповідь:\
\nІгорю знадобиться {total_page} сторінок в альбомі.")

"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
# код вводити тут
print("\nЗавдання 18")
color = input("Який твій улюблений колір: ")
number = input("Яке твоє улюблене число: ")

print(f"\nМій улюблений колір - {color}, а число - {number}.")

"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
# код вводити тут
print("\nЗавдання 19")
all_storage = 375291
first_second_storage = 250449
second_third_storage = 222950

third_storage = all_storage - first_second_storage
second_storage = second_third_storage - third_storage
first_storage = first_second_storage - second_storage
goods = "товарів"

print(f"Мережа супермаркетів має 3 склади, де всього розміщено {all_storage} товар.\
\nНа першому та другому складах перебуває {first_second_storage} {goods}.\
\nНа другому та третьому – {second_third_storage} {goods}.\
\nЗнайдіть кількість {goods}, що розміщені на кожному складі.\
\nВідповідь:\
\nНа першому складі розміщено {first_storage} {goods},\
\nна другому складі розміщено {second_storage} {goods},\
\nна третьому складі розміщено {third_storage} {goods}.")

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
# код вводити тут
print("\nЗавдання 20")
months = int(1.5 * 12)  # півтора року = 18 місяців
monthly_payment = 1179
total_cost = months * monthly_payment

print(f"Михайло разом з батьками вирішили купити комп’ютер,\
\nскориставшись послугою «Оплата частинами».\
\nВідомо, що сплачувати необхідно буде півтора року по {monthly_payment} грн/місяць.\
\nОбчисліть вартість комп'ютера. Кількість місяців для оплати.\
\nВідповідь:\
\nВартість комп'ютера дорівнює {total_cost} грн. Кількість місяців для оплати дорівнює {months}.")
